app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @artist = Artist.find_by_id(params[:id])